---
kind: property
id: P:Autodesk.Revit.DB.Category.AllowsBoundParameters
source: html/7bdf1bee-41ce-45e0-9f00-7c1efa49a502.htm
---
# Autodesk.Revit.DB.Category.AllowsBoundParameters Property

To check if the category can have project parameters.

## Syntax (C#)
```csharp
public bool AllowsBoundParameters { get; }
```